#ფუნქცია არის კოდის ბლოკი, მისი გამოყენება იმიტომ არის კარგი რომ ერთდაიგივე კოდის გაეორება არ მოგვიწევს რამდენჯერმე შეგვიძლია ერთიდაიგივე კოდი დავწეროთ სხვადასხვა პარამეტრით
#def არის keyword რითიც შეგვიძლია ფუნქციის შექმნა
#function name არის ფუნქციის სახელი
#function parameter არის ფუნქციის პარამეტრი რომელიც გადაეცემა ფუნქციას როგორც ცვლადი
#indentation არის ტაბით გამოტოვება რაც იმას მიგვანიშნებს რომ კოდი კონკრეტულ კოდის ბლოკს ეკუთვნის
#code block მაგ: ფუნქციი კოდის ბლოკი, for loop-ის კოდის ბლოკი, ესენი იმას მიგვანიშნებენ რომ რაღაც კოდი ამათ შიგნითაა, ამათ ეკუთვნის და მაგათეზე მოახდინოს გავლენა
#function call ფუნქციის გამოძახება რათა ჩვენი ფუნქციაში დაწერილი კოდის შედეგი ვნახოთ
#function argument იგივე function parameter